# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [1]:
#Write your code here
import pandas as pd
df_data = pd.read_csv('data/Purchase_Data.csv')
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [2]:
#Write your code here
df_data.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [3]:
#Write you code here
result_1 = df_data.loc[:, 'invoice_number':'invoice_time']
result_1.head()

#Write you code here (another way)
# result_1 = df_data.iloc[:, 0:2]
# result_1.head()

   invoice_number   invoice_time
0    2.020000e+11  7/15/15 10:45
1    2.020000e+11  7/15/15 12:16
2    2.020000e+11  7/15/15 12:16
3    2.020000e+11  7/15/15 12:16
4    2.020000e+11  7/15/15 12:16

Slice the first two rows using .loc and store the result in a variable called result_2.

In [4]:
#Write you code here
result_2 = df_data.loc[0:1, :]
result_2

#Write you code here (another way)
# result_2 = df_data.iloc[0:2, :]
# result_2

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [5]:
#Write your code here
result_3 = df_data.loc[0:3, 'invoice_number':'category_id']
result_3

#Write you code here (another way)
# result_3 = df_data.iloc[0:4, 0:5]
# result_3

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [6]:
#Write your code here
result_4 = df_data.loc[[0,4,6], ['invoice_time', 'price']]
result_4

#Write you code here (another way)
# result_4 = df_data.iloc[[0,4,6], [1, 6]]
# result_4

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [7]:
#Write your code here
num_rows = df_data.shape[0] 
num_rows

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [8]:
#Write your code here
#Since the question asks to print it to 'dataframe' not 'series,' slicing is used here instead of indexing.
last_row = df_data.loc[num_rows-1:, :] 
last_row

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [9]:
#Write your code here
avg_price = df_data['price'].mean()
max_price = df_data['price'].max()
print(f'avg_price: {avg_price} \nmax_price: {max_price}')

avg_price: 3.1920522110741354
max_price: 6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [10]:
#Write you code here
avg_price, avg_num_items = df_data[['price', 'num_item']].mean()
print(f'avg_price: {avg_price}\navg_num_items: {avg_num_items}')

avg_price: 3.1920522110741354
avg_num_items: 1.2983091787439613

Create a column called "total", which is the product of the price and num_item columns.

In [11]:
#Write your code here
df_data['total'] = df_data['price'] * df_data['num_item'] 
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,6.0

What is the avgerage price of the three most expensive purchases?

In [12]:
#Write your code here
# Three most expensive purchases
df_top_3_purchases = df_data.sort_values(by = 'total', ascending = False).head(3)
display(df_top_3_purchases)

# The average price of the three most expensive purchases
df_top_3_purchases['total'].mean()

#Write your code here (another way)
# df_top_3_purchases = df_data.sort_values(by = 'total', ascending = False).reset_index(drop = True)
# df_top_3_purchases.loc[0:2, 'total'].mean()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
4510,2.020000e+11,8/30/15 20:21,628,21000362,210301,116.0,3.0,348.0
3784,2.020000e+11,8/26/15 17:12,6666,7000294,210101,48.0,1.5,72.0
4288,2.020000e+11,8/29/15 8:31,6666,7000294,210101,48.0,1.5,72.0

164.0

How many different products are there?

In [13]:
#Write your code here
len(df_data['product_id'].unique())

#Write your code here (another way)
# len(df_data['product_id'].value_counts())

53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [14]:
#Write your code here
df_mean_median = df_data.describe().loc[['mean', '50%'], ['total']].rename(index = {'50%':'median'})
display(df_mean_median)

mean_median_diff = df_mean_median.loc['mean'] - df_mean_median.loc['median']
mean_median_diff

           total
mean    3.931808
median  3.000000

total    0.931808
dtype: float64

Use the drop() method to delete the column total from the dataframe df_data.

In [15]:
#Write your code here
df_data.drop('total', axis = 1, inplace = True)
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Let's dig a little deeper into the data set and answer some basic question.

In [16]:
#Write your code here
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5382 entries, 0 to 5381
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_number  5382 non-null   float64
 1   invoice_time    5382 non-null   object
 2   store_id        5382 non-null   object
 3   product_id      5382 non-null   int64
 4   category_id     5382 non-null   int64
 5   num_item        5382 non-null   float64
 6   price           5382 non-null   float64
dtypes: float64(3), int64(2), object(2)
memory usage: 294.5+ KB

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [17]:
#Write your code here
df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'])
df_data.dtypes

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
dtype: object

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [18]:
#Write your code here

#Instead of dt.weekday, dt.day_name() is used  here for better human readability. 
df_data['DOW'] = df_data['invoice_time'].dt.day_name() 
df_data['Month'] = df_data['invoice_time'].dt.month
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,DOW,Month
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,Wednesday,7
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,7
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,7
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,Wednesday,7
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,Wednesday,7

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [19]:
#Write your code here
num_purchases_wed = df_data['DOW'].value_counts().loc['Wednesday']
num_purchases_wed

959

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [20]:
#Write your code here
df = pd.read_csv("data/Titanic.csv")
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [21]:
#Write your code here
df.rename(columns = {'Name':'Passenger_Name', 'Ticket':'Ticket_Num'}, inplace = True)
df.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index of the df_titanic to the column PasengerID.

In [22]:
#Write your code here
df.set_index('PassengerId', inplace = True)
df.head()

,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Select the name of passenger 896

In [23]:
#Write your code here
df.loc[[896], :]

,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [24]:
#Write your code here
df.reset_index(drop = False, inplace = True)
df.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [25]:
#Write you code here
df['Age'].isnull().sum()

86

Compute the avg age of passengers ignoring the missing data.

In [26]:
#Write your code here
df['Age'].mean()

30.272590361445783

Using the fillna() method replace the missing values in the Age column with the mean.

In [27]:
#Write your code here
df['Age'] = df['Age'].fillna(df['Age'].mean())
print(df['Age'].isnull().sum())
print(df['Age'].mean())

0
30.272590361445815

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [28]:
#Write your code here
#The 5 oldest passengers
five_oldest = df['Age'].sort_values(ascending = False).head(5)
display(five_oldest)

#The average of the 5 oldest passengers
five_oldest.mean()

#Write your code here (another way)
# oldest = df['Age'].sort_values(ascending = False).reset_index(drop = True)
# oldest.loc[0:4].mean()

96     76.0
81     67.0
236    64.0
179    64.0
305    64.0
Name: Age, dtype: float64

67.0